public/designs/frontend/controllers/BadQueryController.php

    public function actionCreate()
    {
        $name = \Yii::$app->request->bodyParams["value"];
        if(!$name){
            throw new BadRequestHttpException('Bad hashtag value.');
        }

        $model = BadQuery::findByName($name);
        if(!$model){
            //Создание нового
            $model = new BadQuery();
            $model->name = $name;
            $model->count = 1;
        }else{
            //апдейт
            $model->count = $model->count + 1;
        }

        if(!$model->save()){
---
INSERT INTO `md_bad_query` (`name`, `count`, `created_at`, `updated_at`) VALUES ('с принтом', 1, 1528816322, 1528816322)