public/designs/frontend/controllers/HashtagStatController.php

SELECT * FROM `md_hashtag_stat` WHERE name = '#Chanel'
INSERT INTO `md_hashtag_stat` (`name`, `click_count`, `created_at`, `updated_at`) VALUES ('#Chanel', 1, 1528739257, 1528739257)
---
    public function actionTransition()
    {
        $hashTag = \Yii::$app->request->bodyParams['hashtagName'];
        $model = HashtagStat::find()->where('name = :hashTag', [':hashTag' => $hashTag])->one();

        if(!$model){
            //Создание нового
            $model = new HashtagStat();
            $model->name = $hashTag;
            $model->click_count = 1;
        }else{
            //апдейт
            $model->click_count = $model->click_count + 1;
        }

        if(!$model->save()){