public/designs/frontend/controllers/MainController.php

SELECT * FROM `md_case_design2hashtag` WHERE `case_design_id` IN ('256', '257', '260', '261', '262', '263', '264', '62', '63', '64', '65', '69', '70', '71', '72', '73', '74', '75', '77', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '91', '92', '93', '94', '95', '98', '99', '100', '101', '102', '103', '105', '106', '107', '108', '109', '110', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122', '123', '124', '125', '126', '127', '128', '129', '131', '132', '133', '134', '137', '138', '139', '140', '141', '142', '143', '144', '145', '146', '147', '149', '150', '151', '152', '153', '154', '155', '156', '158', '161', '162', '164', '166', '167', '168', '169', '170', '171', '172', '173', '174', '175', '176', '177', '178', '180', '181', '182', '184', '185', '186', '187', '188', '189', '190', '191', '192', '193', '195', '196', '198', '199', '202', '203', '204', '205', '210', '211', '214', '215', '219', '220', '223', '224', '225', '226', '229', '230', '232', '233', '234', '235', '236', '238', '239', '240', '242', '244', '245', '246', '247', '248', '249', '253', '254', '255', '258', '259', '67', '76', '96', '97', '104', '111', '135', '148', '157', '165', '183', '194', '207', '208', '212', '216', '218', '227', '228', '237', '243', '68', '78', '90', '130', '197', '200', '201', '206', '213', '217', '221', '222', '252', '59', '136', '179', '209', '250', '251', '66')
SELECT * FROM `md_case_design_item` WHERE `case_design_id` IN ('256', '257', '260', '261', '262', '263', '264', '62', '63', '64', '65', '69', '70', '71', '72', '73', '74', '75', '77', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '91', '92', '93', '94', '95', '98', '99', '100', '101', '102', '103', '105', '106', '107', '108', '109', '110', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122', '123', '124', '125', '126', '127', '128', '129', '131', '132', '133', '134', '137', '138', '139', '140', '141', '142', '143', '144', '145', '146', '147', '149', '150', '151', '152', '153', '154', '155', '156', '158', '161', '162', '164', '166', '167', '168', '169', '170', '171', '172', '173', '174', '175', '176', '177', '178', '180', '181', '182', '184', '185', '186', '187', '188', '189', '190', '191', '192', '193', '195', '196', '198', '199', '202', '203', '204', '205', '210', '211', '214', '215', '219', '220', '223', '224', '225', '226', '229', '230', '232', '233', '234', '235', '236', '238', '239', '240', '242', '244', '245', '246', '247', '248', '249', '253', '254', '255', '258', '259', '67', '76', '96', '97', '104', '111', '135', '148', '157', '165', '183', '194', '207', '208', '212', '216', '218', '227', '228', '237', '243', '68', '78', '90', '130', '197', '200', '201', '206', '213', '217', '221', '222', '252', '59', '136', '179', '209', '250', '251', '66')
SELECT * FROM `md_case_design` ORDER BY `likes_count`
SELECT * FROM `md_hashtag` WHERE `id` IN ('18', '16', '31', '35', '15', '20', '24', '25', '21', '22', '27', '19', '28', '13', '50', '41', '23', '49', '32', '33', '36', '37', '44', '46', '45', '43', '42', '40', '34', '39', '38', '12', '56', '58', '53', '17', '60', '62', '63', '68', '69', '30', '48', '47', '51', '70', '72', '71', '77', '76', '73', '80', '81', '85', '102', '90', '112', '104', '106', '109', '86', '105', '98', '100', '83', '88', '113', '108', '110', '97', '107', '111', '59', '78', '61', '103', '82', '84', '11', '65', '67')
SELECT * FROM `md_page` WHERE id = 2
---
    public function actionIndex()
    {
        $designs = CaseDesign::find()
            ->orderBy('likes_count')
            ->with(['caseDesign2hashtags.hashtag', 'caseDesignItems'])
            ->asArray()
            ->all();

        $resDesigns = [];
        $allHashTags = [];
        foreach ($designs as $design){
            $hashTags = ['#' . str_replace(['-', ' '], '_', mb_strtolower($design['name'])), '#' . str_replace(['-', ' '], '_', mb_strtolower($design['collection']))];
            $slides = [];
            foreach ($design['caseDesign2hashtags'] as $hashtag){
                $hashTags[] = $hashtag['hashtag']['text'];
                $allHashTags[$hashtag['hashtag']['text']] = $hashtag['hashtag']['description'];
            }
            foreach ($design['caseDesignItems'] as $item){
                $slides[] = [
                    'type' => $item['type'],
                    'path' => $item['path'],
                    'link' => $item['link'],
                ];
            }
            if(empty($slides)) continue;
            $page = Page::find()->where('id = 2')->one();

SELECT * FROM `md_banner` WHERE active = 1 ORDER BY `sort`
---
        $hashTags = json_encode($allHashTags);

        //Выбираем банеры
        $banners = Banner::find()
            ->where('active = 1')
            ->orderBy('sort')
            ->asArray()
            ->all();

SELECT * FROM `md_case_design` WHERE `id`='девушка_с_собакой'
SELECT * FROM `md_case_design` where LOWER(`name`) LIKE '%девушка%с%собакой%'
SELECT * FROM `md_hashtag` WHERE text = '#девушка_с_собакой'
---
        $openDesign = false;
        $h1 = '';
        if(!empty($path)){
           $caseDesign = CaseDesign::findOne($path);
            if($caseDesign){
                $title = 'Чехол для телефона ';
                $h1 = 'Чехол на телефон ' . $caseDesign->name;
                foreach ($caseDesign->getCaseDesign2hashtags()->all() as $ht) {

SELECT * FROM `md_page` WHERE id = 1
---
                    }
                }
            }
            $page = Page::find()->where('id = 2')->one();