public/designs/frontend/models/BadQuery.php

    public static function findByName($name){
        return self::find()->where('name = :name', [':name' => $name])->one();
---
SELECT * FROM `md_bad_query` WHERE name = 'с принтом'