<div class="card-info__section card-info__section--text">
    <div class="card-info__title">Доставка и оплата</div>
    <div class="card-info__text">
        <p>Изготавливаем чехлы на заказ 1-2 дня.<br/>
            После оформления заказа с Вами свяжется менеджер.<br/>
            Выполняем заказы по 100% предоплате.<br/>
        </p>
        <p>Самовывоз в Москве - оплата наличными, переводы банк онлайн.</p>
        <p>Курьером по Москве (в пределах МКАД) – 350 руб., до метро 250 руб.</p>
        Доставляем с ПН по СБ с 11:00 до 20:00. Можно без предоплаты.</p>
        <p>Пункты самовывоза по Москве - от 155 руб.</p>
        <p>Курьером по России – от 250 руб.</p>
        <p>Пункты самовывоза по России - от 175 руб.</p>
        <p>Почтой России - от 200 руб. Срок доставки 7-14 дней.</p>
    </div>
</div>