<?php

return [
    'name' => [
        'new'          => 'Новых заказов',
        'paid'         => 'Заказов оплачено',
        'wait_payment' => 'Ждем оплату',
        'designing'    => 'Делаем макет',

        'printing'          => 'Заказов в печати',
        'print_with_defect' => 'Брак/неполный',
        'print_pickup'      => 'Самовывоз',
        'print_sdek'        => 'СДЭК',
        'print_courier'     => 'Курьер',

        'total'         => 'Всего заказов',
        'no_connection' => 'Не дозвонились',
        'thinks'        => 'Думает/перезвонить',
        'finished'      => 'Завершено',
        'canceled'      => 'Отменено',

        'total_cases' => 'Всего чехлов',
        'avg_cases'   => 'Чехлов на корзину',
        'rate'        => 'Конверсия из корзины в заказ',
        'abandoned'   => 'Брошенных',

        'sum' => 'Сумма оплат',
        'avg_sum' => 'Средний доход с корзины',
    ],
];